notes/meeting_2022apr10.org
* meeting notes April 10, 2022
** the raku study group
** an answer to what's Raku for:
*** https://www.codesections.com/blog/raku-manifesto/

** postponed from previous meetings
*** rob asks about "DEPRECATED"
*** bill's unix.stackexchange post


** recent topics
*** demanual
Mixing supplies, channels and promises makes the code hang or throwing exceptions
https://github.com/rakudo/rakudo/issues/4853

lizmat fix to master branch
https://github.com/rakudo/rakudo/commit/5658f4da07b44d492a3d35d57fa76939822d2c66



** announcements 
*** April 24th: next raku study group meeting 
*** June 21-25: tprc: perl/raku conference 
