notes/meeting_2022apr10.md
- [meeting notes April 10, 2022](#org9527704)
  - [the raku study group](#org199bdb0)
  - [an answer to what's Raku for:](#orgc1c66db)
    - [<https://www.codesections.com/blog/raku-manifesto/>](#orgd6c2994)
  - [postponed from previous meetings](#org06533d1)
    - [rob asks about "DEPRECATED"](#org6501da2)
    - [bill's unix.stackexchange post](#org284e948)
  - [recent topics](#org6e48b3e)
    - [demanual](#org8d229d5)
  - [announcements](#org2f51944)
    - [April 24th: next raku study group meeting](#orgabbc416)
    - [June 21-25: tprc: perl/raku conference](#org105f3a6)


<a id="org9527704"></a>

# meeting notes April 10, 2022


<a id="org199bdb0"></a>

## the raku study group


<a id="orgc1c66db"></a>

## an answer to what's Raku for:


<a id="orgd6c2994"></a>

### <https://www.codesections.com/blog/raku-manifesto/>


<a id="org06533d1"></a>

## postponed from previous meetings


<a id="org6501da2"></a>

### rob asks about "DEPRECATED"


<a id="org284e948"></a>

### bill's unix.stackexchange post


<a id="org6e48b3e"></a>

## recent topics


<a id="org8d229d5"></a>

### demanual

Mixing supplies, channels and promises makes the code hang or throwing exceptions <https://github.com/rakudo/rakudo/issues/4853>

lizmat fix to master branch <https://github.com/rakudo/rakudo/commit/5658f4da07b44d492a3d35d57fa76939822d2c66>


<a id="org2f51944"></a>

## announcements


<a id="orgabbc416"></a>

### April 24th: next raku study group meeting


<a id="org105f3a6"></a>

### June 21-25: tprc: perl/raku conference
